app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("title", "price", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "abc"], ["price", 600], ["description", "ugjkb"], ["created_at", "2016-05-04 08:24:59.655545"], ["updated_at", "2016-05-04 08:24:59.655545"]]